-- phpMyAdmin SQL Dump
-- version 4.0.10.6
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 08 2015 г., 13:22
-- Версия сервера: 5.5.41-log
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `pool`
--

-- --------------------------------------------------------

--
-- Структура таблицы `maintexts`
--

CREATE TABLE IF NOT EXISTS `maintexts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` tinytext CHARACTER SET utf8mb4 NOT NULL,
  `body` text CHARACTER SET utf8mb4 NOT NULL,
  `url` tinytext CHARACTER SET utf8mb4 NOT NULL,
  `lang` enum('ru','en') CHARACTER SET utf8mb4 NOT NULL DEFAULT 'ru',
  `showhide` enum('show','hide') CHARACTER SET utf8mb4 NOT NULL DEFAULT 'show',
  `putdate` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=8 ;

--
-- Дамп данных таблицы `maintexts`
--

INSERT INTO `maintexts` (`id`, `name`, `body`, `url`, `lang`, `showhide`, `putdate`) VALUES
(1, '', '<p style="text-align:center"><strong>Электронная библиотека</p></strong>\n<p> Поиск, чтение онлайн и скачивание книг доступна как зарегистрированным, так и анонимным посетителям. Но лучше все-таки зарегистрироваться, это расширяет ваши возможности: будет отключена реклама, появятся права на выкачку всех произведений автора одним файлом, выбор формата скачиваемой книги, доступ к иноязычной литературе, возможность участвовать в форумах, добавлять и оценивать книги и многое прочее.</p>', 'index', 'ru', 'show', '2015-03-03'),
(3, '', '<p> Популярные книги 2013 года.</p>\n<p>Популярные книги 2014 года.</p>\n<p>За месяц</p>\n<p>За неделю</p>\n\n', 'pop', 'ru', 'show', '2015-03-30'),
(4, '', 'Книги, которые стоит прочитать:\n<ol>\n<li>«Властелин колец» — Джон Р.Р.Толкин</li>\n<li>«Гордость и предубеждение» — Джейн Остин\n<li>«Тёмные начала» — Филип Пулман\n<li>«Автостопом по галактике» — Дуглас Адамс\n<li>«Гарри Поттер и Кубок огня» — Джоан Роулинг\n<li>«Убить пересмешника» — Харпер Ли\n<li>«Винни-Пух и все-все-все» — Алан Милн\n<li>«1984» — Джордж Оруэлл\n<li>«Джейн Эйр» — Шарлотта Бронте\n<li>«Уловка-22» — Джозеф Хеллер\n<li>«Грозовой перевал» — Эмили Бронте\n<li>«Пение птиц» — Себастьян Фолкс\n<li>«Ребекка» — Дафна Дюморье\n<li>«Над пропастью во ржи» — Джером Сэлинджер\n<li>«Ветер в ивах» — Кеннет Грэм\n<li>«Большие надежды» — Чарльз Диккенс\n<li>«Маленькие женщины» — Луиза Мэй Олкотт\n<li>«Мандолина капитана Корелли» — Луи де Бернье\n<li>«Война и мир» — Лев Толстой\n<li>«Унесенные ветром» — Маргарет Митчелл\n<li>«Гарри Поттер и философский камень» — Джоан Роулинг\n<li>«Гарри Поттер и Тайная комната» — Джоан Роулинг\n<li>«Гарри Поттер и узник Азкабана» — Джоан Роулинг\n<li>«Хоббит» — Джон Р. Р. Толкин\n<li>«Тэсс из рода д’Эрбервиллей» — Томас Харди\n<li>«Миддлмарч» — Джордж Элиот\n<li>«Молитва об Оуэне Мини» — Джон Ирвинг\n<li>«Гроздья гнева» — Джон Стейнбек\n<li>«Алиса в Стране чудес» — Льюис Кэрролл\n<li>«Дневник Трейси Бикер» — Жаклин Уилсон\n<li>«Сто лет одиночества» — Габриэль Гарсиа Маркес\n<li>«Столпы Земли» — Кен Фоллетт\n<li>«Дэвид Копперфильд» — Чарльз Диккенс\n<li>«Чарли и шоколадная фабрика» — Роальд Даль\n<li>«Остров сокровищ» — Роберт Стивенсон\n<li>«Город как Элис» — Невил Шют\n<li>«Доводы рассудка» — Джейн Остин\n<li>«Дюна» — Фрэнк Герберт\n<li>«Эмма» — Джейн Остин\n<li>«Аня из Зеленых Мезонинов» — Люси Мод Монтгомери\n<li>«Обитатели холмов» — Ричард Адамс\n<li>«Великий Гэтсби» — Фрэнсис Скотт Фицджеральд\n<li>«Граф Монте-Кристо» — Александр Дюма\n<li>«Возвращение в Брайдсхед» — Ивлин Во\n<li>«Скотный двор» — Джордж Оруэлл\n<li>«Рождественская песнь» — Чарльз Диккенс\n<li>«Вдали от обезумевшей толпы» — Томас Харди\n<li>«Спокойной ночи, мистер Том» — Мишель Магориан\n<li>«Семейная реликвия» — Розамунд Пилчер\n<li>«Мартин иден» — Джек лондон\n</ol>', 'top', 'ru', 'show', '2015-03-30'),
(5, '', 'У нас вы можете не только скачать книги в разных форматах, а так же заказать. \n', 'zakaz', 'ru', 'show', '0000-00-00'),
(6, 'Форум', '', 'forum', 'ru', 'show', '0000-00-00'),
(7, 'Обратная связь', '', 'kontakty', 'ru', 'show', '0000-00-00');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
